# 为什么HTTP要具备识别用户的能力
 web服务器为了向用户提供更精准，更个性化的服务，需要具备识别用户客户端的能力。本文主要对HTTP如何区分不同的用户，不同的客户端的方式方法做一个总结。
# HTTP首部
最容易想到的方法就是添加HTTP首部。我们来看一下几个相关的首部：
## from
`from:"xxxx@gmail.com"`通过在请求头部添加该字段，服务器通过请求来源的email地址来区分用户。理想的情况下，该方案不失为一种思路。但实际用户的email很容易会被人获取到，并被用来向用户发送垃圾邮件。所以很少有人使用这种方式。
## referer
`referer:https://www.google.com/`。referer字段能够说明用户是从什么网站过来的。但是没办法做到区分是哪个用户。
## user-agent
`user-agent:Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/59.0.3071.115 Safari/537.36`该字段也存在同样的问题，虽然能区分用户的浏览器，操作系统等信息，但仍旧无法区分是哪个用户。
## 高级首部字段
authorization、Client-IP、cookie等。其中authorization和cookie，我们在下面的部分会有详细说明。
# 通过客户端IP来区分
我们知道每个客户端在与服务器通信的建立通信的时候，必然会用到IP地址的。在客户端IP和客户端是一对一的情况下，确实可以使用客户端IP来作为区分客户端的依据。但现实是，多个客户端可以公用一个IP地址，有的IP地址是动态分配的，甚至IP可以伪造的。所以现实决定了使用客户端IP来识别用户也不是一个有效的方式。
# 使用fat URL
fat URL 光看名字大家就能猜出一二了。无非就是web服务器为用户动态生成一个超链接，超链接上插入了用来识别每个用户的标识符。这样，用户访问了带有标识符的链接时，服务器会根据对应的标识符来向用户显示对应的内容。但这种方式的问题也很明显：1.用户的个人信息可能会显示给别人2.如果用户跳出了链接，所相关的信息都会丢失。
# 用户登录认证
这种方式是服务器主动要求用户提供个人账号和密码等信息。用户验证通过后，服务器就可以针对该用户提供个性化的服务了。具体流程就是客户端浏览器向服务器发起请求，服务器回送一个401 login request的响应，响应头设置www-auhorization字段，要求用户提供账号信息。用户填写完信息，将认证信息添加到autorization字段中，再次发起请求。服务器验证通过，并将资源返回给用户。
todo：示意图
但也有一个问题就是，如果用户访问多个网站，每个网站都需要用户提供用户账号信息，用户需要记住多个账号密码，如果网站多了，用户会被记忆这么多账号密码逼疯的。

# 使用cookie
## cookie的工作原理
## cookie的属性
## 总结
